#Вариант 6. Павлова Марина.

print ('Начало программы #1')
a = float (input ('Введите число a = '))
b = float (input ('Введите число b = '))
c = float (input ('Введите число c = '))
if b == 0:
    print('Введите число b, отличное от 0')
elif a % b == c and a / b == c:
    print('a =', a, 'дает остаток c =', c, 'при делении на b =', b, 'и деление a =', a, ' на b =', b, ' дает значение с =', c)
elif a % b == c:
    print ('a =', a, 'дает остаток c =', c, 'при делении на b =', b,', НО деление a =', a, ' на b =', b, ' НЕ дает значение с =', c)
elif a / b == c:
    print ('Деление a =', a, ' на b =', b, ' дает значение с =', c,', НО a =', a, 'НЕ дает остаток c =', c, 'при делении на b =', b)
elif a % b != c and a / b != c:
    print ('a =', a, 'НЕ дает остаток c =', c, 'при делении на b =', b, 'и деление a =', a, ' на b =', b, ' НЕ дает значение с =', c)
print ('Конец программы #1')
